<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd #pandas를 pd라고 부른다.

In [2]:
friend_dict_list = [{'name':'John', 'age': 25, 'job': 'student'},{'name':'Nate', 'age': 30, 'job': 'teacher'}]

In [3]:
df = pd.DataFrame(friend_dict_list) #friend_dict_list를 pandas를 이용해 데이터프레임을 만든다.

In [4]:
df.head() #dictionary같은 경우 순서를 재지정해줘야하는 단점이 생긴다.

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [5]:
df = df[['name','age','job']] #column을 원하는대로 재지정한다.

In [6]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [7]:
from collections import OrderedDict #python에서 OrderedDict을 불러옴,(coulumns의 순서가 보장됨)

In [8]:
friend_ordered_dict = OrderedDict([('name', ['John', 'Nate']),('age', [25, 30]),('job', ['student', 'teacher'])])

In [9]:
df = pd.DataFrame.from_dict(friend_ordered_dict) # 한 번에 데이터프레임 만들 수 있는 방법

In [10]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [11]:
friend_list = [['John', 20, 'student'],['Nate', 30, 'teacher']] #파이썬의 리스트를 활용하여 데이터프레임 만들기

In [12]:
column_name = ['name', 'age','job']

In [13]:
df = pd.DataFrame.from_records(friend_list, columns = column_name) #friend_list와 columns에 해당하는 columns_name을 불러와 데이터프레임 만들기

In [14]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [17]:
data = [['name',['John', 'Nate']],['age',[20, 30]],['job',['student', 'teacher']]]

In [18]:
df = pd.DataFrame.from_dict(OrderedDict(data))

In [19]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher